#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Cybersecurity-Eli_Lilly/cloudflare-terraform/runs/run-G7ZnHygdHEetiFVY

Waiting for the plan to start...

Terraform v1.12.1
on linux_amd64
Initializing plugins and modules...
module.testiac_zone.cloudflare_zone.testiac_zone: Refreshing state... [id=f259176e50abd483e17406c3621f22cf]
module.zone_id_ac3362a9551d91a684109620e04c075f.cloudflare_record.iac-test: Refreshing state... [id=573c1ae810641eb1e28215543730f529]
module.zone_id_ac3362a9551d91a684109620e04c075f.cloudflare_zone_settings_override.zone_settings: Refreshing state... [id=ac3362a9551d91a684109620e04c075f]
module.testiac_zone.cloudflare_page_rule.cache_everything: Refreshing state... [id=ace05cb3631324a4ca63d63052649d03]
module.testiac_zone.cloudflare_certificate_pack.advanced_cert: Refreshing state... [id=5d3983a9-872f-4058-b0e3-61f6ed2561d9]
module.testiac_zone.cloudflare_zone_dnssec.dnssec: Refreshing state... [id=f259176e50abd483e17406c3621f22cf]
module.testiac_zone.cloudflare_record.www: Refreshing state... [id=c319ad40e6c49cd3aeea942c4296f0a9]
module.testiac_zone.cloudflare_page_rule.https_redirect: Refreshing state... [id=e0eca76d688bdd09de0b3e5ed291d73d]
module.testiac_zone.cloudflare_record.mail: Refreshing state... [id=eac32eea7d8cdaf89d194c1c39ab4792]
module.testiac_zone.cloudflare_record.dev: Refreshing state... [id=15aa7a5aed684e21d69a89dc39eda359]
module.testiac_zone.cloudflare_ruleset.waf_rules: Refreshing state... [id=a5c9395b1b474316a45b854d0aac1e41]
module.testiac_zone.cloudflare_zone_settings_override.zone_settings: Refreshing state... [id=f259176e50abd483e17406c3621f22cf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.zone_id_ac3362a9551d91a684109620e04c075f.cloudflare_record.sample_record will be created
  + resource "cloudflare_record" "sample_record" {
      + allow_overwrite = false
      + content         = "192.0.2.1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test-action"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "ac3362a9551d91a684109620e04c075f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ayush-lilly, Action: `pull_request`*